# brew tap ...
tap "go-task/tap"
tap "adoptopenjdk/openjdk"
tap "esolitos/ipa"
tap "aws/tap"
tap "microsoft/git"
tap "tofuutils/tap"

# Cloud
brew "awscli"
brew "aws-sam-cli"
brew "copilot-cli"
brew "cfn-lint"
brew "cloudformation-guard"
brew "tfenv"
brew "tofuenv"
brew "tflint"
brew "pulumi"

brew "bzip2"
brew "caddy"
brew "coreutils"
brew "curl"
brew "direnv"
brew "gettext"
brew "gh"
brew "git"
brew "gnu-sed"
brew "go"
brew "go-task"
brew "gomplate"
brew "helm"
brew "htmltest"
brew "httrack"
brew "hugo"
brew "jq"
brew "kubectl"
brew "libssh2"
brew "libyaml"
brew "openldap"
brew "openssl"
brew "pkg-config"
brew "readline"
brew "sqlite"
brew "sshpass"
brew "telnet"
brew "tfenv"
brew "vim"
brew "wget"
brew "xz"
brew "yq"
# brew "zola"
brew "zlib"
brew "zsh"

cask "adobe-acrobat-reader"
cask "aerial"
# cask "adoptopenjdk8"
# cask "alfred"  # license + aws gives v4 instead of v5, install manually
cask "alt-tab"
cask "bartender"  # check license
# cask "docker"
cask "drawio"
# cask "firefox"
cask "focusatwill"
cask "flux"
cask "git-credential-manager"
# cask "gns3"
# cask "google-chrome"
cask "iglance"
cask "iterm2"
cask "kindle"
# cask "logitech-presentation"
cask "microsoft-remote-desktop"
# cask "notion"
# cask "orbstack"
# cask "postman"
cask "scroll-reverser"
cask "spotify"
cask "vagrant"
cask "visual-studio-code"
cask "vlc"
cask "vnc-viewer"
# cask "webex"
cask "wireshark"
# cask "zoom"

# personal
# cask "bitwarden"
# cask "discord"
# cask "paragon-ntfs"  # check license
# cask "signal"
# cask "slack"
# cask "telegram-desktop"
# cask "the-unarchiver"
# cask "path-finder"  # check license
