# 'brew tap'
tap "homebrew/cask"
tap "go-task/tap"
tap "adoptopenjdk/openjdk"
tap "esolitos/ipa"

brew "awscli"
brew "bzip2"
brew "caddy"
brew "copilot-cli"
brew "coreutils"
brew "curl"
brew "direnv"
brew "gettext"
brew "git"
brew "gnu-sed"
brew "go"
brew "go-task"
brew "gomplate"
brew "helm"
brew "htmltest"
brew "httrack"
brew "hugo"
brew "jq"
brew "kubernetes-cli"
brew "libssh2"
brew "libyaml"
brew "openldap"
brew "openssl"
brew "pkg-config"
brew "pulumi"
brew "readline"
brew "sqlite"
brew "sshpass"
brew "telnet"
brew "terraform"
brew "vim"
brew "wget"
brew "xz"
brew "yq"
brew "zlib"
brew "zsh"

cask "adobe-acrobat-reader"
# cask "adoptopenjdk8"
cask "alfred"  # check license
cask "alt-tab"
cask "bartender"  # check license
cask "bitwarden"
# cask "box-sync"
cask "discord"
cask "docker"
cask "drawio"
cask "dropbox"
cask "firefox"
cask "flux"
cask "gns3"
cask "google-chrome"
cask "iglance"
cask "iterm2"
cask "kindle"
cask "logitech-presentation"
cask "microsoft-remote-desktop"
cask "onedrive"
cask "paragon-ntfs"  # check license
cask "path-finder"  # check license
cask "postman"
cask "scroll-reverser"
# cask "signal"
cask "slack"
cask "spotify"
cask "telegram-desktop"
cask "the-unarchiver"
# cask "protonmail-bridge"
# cask "virtualbox"
cask "vagrant"
cask "visual-studio-code"
cask "vlc"
cask "vnc-viewer"
cask "webex"
cask "wireshark"
cask "zoom"
